using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace XMLSer
{
    public class Dictonary
    {
        public string[] phonesGoods =
            {"Acer",
"Alcatel",
"ASUS",
"BlackBerry",
"BQ",
"DEXP",
"Explay",
"Fly",
"Highscreen",
"HTC",
"Huawei",
"iPhone",
"Lenovo",
"LG",
"Meizu",
"Micromax",
"Microsoft",
"Motorola",
"MTS",
"Nokia",
"Panasonic",
"Philips",
"Prestigio",
"Samsung",
"Siemens",
"SkyLink",
"Sony",
"teXet",
"Vertu",
"Xiaomi",
"ZTE",
"Другие марки",
"Рации",
"Стационарные телефоны",
"Аккумуляторы",
"Гарнитуры и наушники",
"Зарядные устройства",
"Кабели и адаптеры",
"Модемы и роутеры",
"Чехлы и плёнки",
"Запчасти"};

        public string[] audVidNames =
            {"MP3-плееры",
"Акустика, колонки, сабвуферы",
"Видео, DVD и Blu-ray плееры",
"Видеокамеры",
"Кабели и адаптеры",
"Микрофоны",
"Музыка и фильмы",
"Музыкальные центры, магнитолы",
"Наушники",
"Телевизоры и проекторы",
"Усилители и ресиверы",
"Аксессуары"};

        public string[] compGoodsNames =
            {"Акустика",
"Веб-камеры",
"Джойстики и рули",
"Клавиатуры и мыши",
"CD, DVD и Blu-ray приводы",
"Блоки питания",
"Видеокарты",
"Жёсткие диски",
"Звуковые карты",
"Контроллеры",
"Корпусы",
"Материнские платы",
"Оперативная память",
"Процессоры",
"Системы охлаждения",
"Мониторы",
"Переносные жёсткие диски",
"Сетевое оборудование",
"ТВ-тюнеры",
"Флэшки и карты памяти",
"Аксессуары"};
        public string[] phoTechNames =
        {
           "Компактные фотоаппараты",
"Зеркальные фотоаппараты",
"Плёночные фотоаппараты",
"Бинокли и телескопы",
"Объективы",
"Оборудование и аксессуары"
        };
        public string[] gamConsProgNames =
            {"Игровые приставки",
"Игры для приставок",
"Компьютерные игры",
"Программы"
            };
        public string[] ofEquipConsumNames =
            {"МФУ, копиры и сканеры",
"Принтеры",
"Телефония",
"ИБП, сетевые фильтры",
"Уничтожители бумаг",
"Блоки питания и батареи",
"Болванки",
"Бумага",
"Кабели и адаптеры",
"Картриджи",
"Канцелярия"
        };
        public string[] tablBooksNames =
            {"Планшеты",
"Электронные книги",
"Аксессуары",
"Аккумуляторы",
"Гарнитуры и наушники",
"Док-станции",
"Зарядные устройства",
"Кабели и адаптеры",
"Модемы и роутеры",
"Стилусы",
"Чехлы и плёнки",
"Другое"
        };
        public string[] laptopNames =
            {"Acer",
"Apple",
"ASUS",
"Compaq",
"Dell",
"Fujitsu",
"HP",
"Huawei",
"Lenovo",
"MSI",
"Packard Bell",
"Microsoft",
"Samsung",
"Sony",
"Toshiba",
"Xiaomi",
"Другой"
        };
        public string[] manWomenAccesNames =
        {
            "Женская одежда",
"Мужская одежда",
"Аксессуары"
        };
        public string[] clockFineryNames =
            {"Бижутерия",
"Часы",
"Ювелирные изделия"
        };
        public string[] toolNames = {"Инструменты","Садовая техника"};
        public string[] womenApparelNames =
           {"Брюки",
"Верхняя одежда",
"Джинсы",
"Купальники",
"Нижнее бельё",
"Обувь",
"Пиджаки и костюмы",
"Платья и юбки",
"Рубашки и блузки",
"Свадебные платья",
"Топы и футболки",
"Трикотаж",
"Другое"
        };
        public string[] menApparelNames =
           {"Брюки",
"Верхняя одежда",
"Джинсы",
"Обувь",
"Пиджаки и костюмы",
"Рубашки",
"Свадебные платья",
"Трикотаж и футболки",
"Другое"
        };
        public string[] accesApparelNames =
           {"Сумки",
"Рюкзаки",
"Головные уборы",
"Чемоданы и дорожные сумки",
"Пиджаки и костюмы",
"Платки и шарфы",
"Кошельки, визитницы, ключницы",
"Очки",
"Ремни, пояса, подтяжки",
"Перчатки и варежки",
"Украшения",
"Портфели и борсетки",
"Носки, чулки, колготки",
"Зонты",
"Обложки для документов",
"Аксессуары для волос",
"Косметички и бьюти–кейсы",
"Галстуки и бабочки",
"Другое"
        };
        public string[] menTopApparelNames =
           {"Зимние куртки и пуховики",
"Лёгкие куртки и ветровки",
"Демисезонные куртки",
"Пальто",
"Дублёнки и шубы",
"Жилеты",
"Парки",
"Джинсовые куртки",
"Кожаные куртки",
"Бомберы",
"Плащи и тренчи",
"Косухи",
"Анораки",
"Другое"
        };
        public string[] womenTopApparelNames =
           {"Шубы",
"Пальто",
"Зимние куртки и пуховики",
"Демисезонные куртки",
"Плащи и тренчи",
"Парки",
"Жилеты",
"Джинсовые куртки",
"Лёгкие куртки и ветровки",
"Дублёнки",
"Кожаные куртки",
"Косухи",
"Бомберы",
"Пончо",
"Анораки",
"Другое"
        };
        public string[] womenTopSizeNames =
        {
            "38 (XXS)",
"40 (XS)",
"42 (S)",
"44 (S/M)",
"46 (M)",
"48 (L)",
"50 (L/XL)",
"52 (XL)",
"54 (XXL)",
"56 (3XL)",
"58 (4XL)",
"60 (5XL)",
"62 (5XL)",
"64 (6XL)",
"66 (6XL)",
"68 (7XL)",
"70 (7XL)",
"72 (8XL)",
"74 (8XL)",
"76 (8XL)",
"78 (8XL) и больше",
"Без размера"
        };
        public string[] menTopSizeNames =
        {
"40 (XXS)",
"42 (XS)",
"44 (XS/S)",
"46 (S)",
"48 (M)",
"50 (L)",
"52 (L/XL)",
"54 (XL)",
"56 (XXL)",
"58 (XXL)",
"60 (3XL)",
"62 (4XL)",
"64 (5XL)",
"66 (6XL)",
"68 (7XL)",
"70 (7XL)",
"72 (8XL)",
"74 (8XL)",
"76 (9XL)",
"78 (10XL)",
"80 (10XL)",
"82 (10XL) и больше",
"Без размера"
        };


    }

}
