using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace XMLSer
{
    public class Dictonary
    {
        public string[] phonesGoods = 
            {"Acer",
"Alcatel",
"ASUS",
"BlackBerry",
"BQ",
"DEXP",
"Explay",
"Fly",
"Highscreen",
"HTC",
"Huawei",
"iPhone",
"Lenovo",
"LG",
"Meizu",
"Micromax",
"Microsoft",
"Motorola",
"MTS",
"Nokia",
"Panasonic",
"Philips",
"Prestigio",
"Samsung",
"Siemens",
"SkyLink",
"Sony",
"teXet",
"Vertu",
"Xiaomi",
"ZTE",
"Другие марки",
"Рации",
"Стационарные телефоны",
"Аккумуляторы",
"Гарнитуры и наушники",
"Зарядные устройства",
"Кабели и адаптеры",
"Модемы и роутеры",
"Чехлы и плёнки",
"Запчасти"};

        public string[] audVidNames = 
            {"MP3-плееры",
"Акустика, колонки, сабвуферы",
"Видео, DVD и Blu-ray плееры",
"Видеокамеры",
"Кабели и адаптеры",
"Микрофоны",
"Музыка и фильмы",
"Музыкальные центры, магнитолы",
"Наушники",
"Телевизоры и проекторы",
"Усилители и ресиверы",
"Аксессуары"};

        public string[] compGoodsNames = 
            {"Акустика",
"Веб-камеры",
"Джойстики и рули",
"Клавиатуры и мыши",
"CD, DVD и Blu-ray приводы",
"Блоки питания",
"Видеокарты",
"Жёсткие диски",
"Звуковые карты",
"Контроллеры",
"Корпусы",
"Материнские платы",
"Оперативная память",
"Процессоры",
"Системы охлаждения",
"Мониторы",
"Переносные жёсткие диски",
"Сетевое оборудование",
"ТВ-тюнеры",
"Флэшки и карты памяти",
"Аксессуары"};
        public string[] phoTechNames =
        {
           "Компактные фотоаппараты",
"Зеркальные фотоаппараты",
"Плёночные фотоаппараты",
"Бинокли и телескопы",
"Объективы",
"Оборудование и аксессуары"
        };
        public string[] gamConsProgNames =
            {"Игровые приставки",
"Игры для приставок",
"Компьютерные игры",
"Программы"
            };
        public string[] ofEquipConsumNames =
            {"МФУ, копиры и сканеры",
"Принтеры",
"Телефония",
"ИБП, сетевые фильтры",
"Уничтожители бумаг",
"Блоки питания и батареи",
"Болванки",
"Бумага",
"Кабели и адаптеры",
"Картриджи",
"Канцелярия"
        };
        public string[] tablBooksNames =
            {"Планшеты",
"Электронные книги",
"Аксессуары",
"Аккумуляторы",
"Гарнитуры и наушники",
"Док-станции",
"Зарядные устройства",
"Кабели и адаптеры",
"Модемы и роутеры",
"Стилусы",
"Чехлы и плёнки",
"Другое"
        };
        public string[] laptopNames =
            {"Acer",
"Apple",
"ASUS",
"Compaq",
"Dell",
"Fujitsu",
"HP",
"Huawei",
"Lenovo",
"MSI",
"Packard Bell",
"Microsoft",
"Samsung",
"Sony",
"Toshiba",
"Xiaomi",
"Другой"
        };
    }

}
